; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	spectrograph3 - mode
	infrared0 - mode
	infrared1 - mode
	spectrograph2 - mode
	thermograph4 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph4)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph4)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph3)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument10 infrared1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star0)
	(supports instrument11 thermograph4)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite2 Phenomenon16)
	(have_image Planet4 thermograph4)
	(have_image Planet5 spectrograph2)
	(have_image Star6 spectrograph3)
	(have_image Star7 infrared1)
	(have_image Planet9 spectrograph2)
	(have_image Star10 spectrograph3)
	(have_image Planet11 thermograph4)
	(have_image Star13 spectrograph2)
	(have_image Planet14 infrared1)
	(have_image Star15 spectrograph3)
	(have_image Phenomenon16 spectrograph2)
	(have_image Planet17 infrared1)
	(have_image Star18 infrared0)
	(have_image Phenomenon19 thermograph4)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 16
2. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 16
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
4. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 16
5. (turn_to satellite4 planet14 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet14)
   goals met: 0 of 16
6. (take_image satellite4 planet14 instrument10 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 1 of 16
7. (turn_to satellite4 planet17 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet17)
   goals met: 1 of 16
8. (take_image satellite4 planet17 instrument10 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 2 of 16
9. (turn_to satellite4 star18 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 star18)
   goals met: 2 of 16
10. (take_image satellite4 star18 instrument10 infrared0)
   added: (have_image star18 infrared0)
   goals met: 3 of 16
11. (turn_to satellite4 star7 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star7)
   goals met: 3 of 16
12. (take_image satellite4 star7 instrument10 infrared1)
   added: (have_image star7 infrared1)
   goals met: 4 of 16
13. (turn_to satellite2 groundstation3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation3)
   goals met: 4 of 16
14. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 4 of 16
15. (turn_to satellite2 phenomenon16 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon16)
   goals met: 5 of 16
16. (turn_to satellite1 planet14 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet14)
   goals met: 6 of 16
17. (turn_to satellite0 groundstation3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation3)
   goals met: 6 of 16
18. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 6 of 16
19. (turn_to satellite0 phenomenon16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 16
20. (take_image satellite0 phenomenon16 instrument0 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 7 of 16
21. (turn_to satellite0 planet5 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet5)
   goals met: 7 of 16
22. (take_image satellite0 planet5 instrument0 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 8 of 16
23. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 8 of 16
24. (take_image satellite0 planet9 instrument0 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 9 of 16
25. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 9 of 16
26. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 10 of 16
27. (turn_to satellite2 phenomenon19 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon19)
   goals met: 9 of 16
28. (take_image satellite2 phenomenon19 instrument5 thermograph4)
   added: (have_image phenomenon19 thermograph4)
   goals met: 10 of 16
29. (turn_to satellite2 phenomenon16 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 phenomenon16)
   goals met: 11 of 16
30. (turn_to satellite2 planet11 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet11)
   goals met: 10 of 16
31. (take_image satellite2 planet11 instrument5 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 11 of 16
32. (turn_to satellite2 phenomenon16 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon16)
   goals met: 12 of 16
33. (turn_to satellite2 planet4 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet4)
   goals met: 11 of 16
34. (take_image satellite2 planet4 instrument5 thermograph4)
   added: (have_image planet4 thermograph4)
   goals met: 12 of 16
35. (turn_to satellite2 phenomenon16 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 phenomenon16)
   goals met: 13 of 16
36. (turn_to satellite2 star10 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 star10)
   goals met: 12 of 16
37. (take_image satellite2 star10 instrument5 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 13 of 16
38. (turn_to satellite2 phenomenon16 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon16)
   goals met: 14 of 16
39. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 14 of 16
40. (take_image satellite0 star15 instrument0 spectrograph3)
   added: (have_image star15 spectrograph3)
   goals met: 15 of 16
41. (turn_to satellite2 star6 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 star6)
   goals met: 14 of 16
42. (take_image satellite2 star6 instrument5 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 15 of 16
43. (turn_to satellite2 phenomenon16 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon16)
   goals met: 16 of 16
